# cx_Oracle

In [3]:
import pandas as pd
import numpy as np
# pip install cx-Oracle
import cx_Oracle

# with cx_Oracle.connect("ai", "0000", "localhost:1521/XE") as conn :
#     if bool(conn) :
#         print("연결성공")
#     else:
#         print("연결실패")
#     with conn.cursor() as cur:
#         cur.execute("select * from emp")
#         for row in cur:
#             print( list(row)  )
#         # cur.close()
# # conn.close()


#--------------------------------------------------
# DDL & DML
#--------------------------------------------------
# CREATE TABLE ADDR (
#     SEQ number PRIMARY KEY ,
#     NAME VARCHAR2(10),
#     TEL VARCHAR2(15)
# );
#
# drop sequence addr_seq ;
# create sequence addr_seq
# start with 1
# increment by 1
# nocache;
#
# insert into addr values(addr_seq.nextval, '홍길동', '000');
# select * from addr;
# commit;
# #-----------------------------------------------

#--------------------------------------------------
# insert : 1 row
# insert into addr values(addr_seq.nextval, '홍길동', '000');
#--------------------------------------------------
# conn = cx_Oracle.connect("ai", "0000", "localhost:1521/XE")
# sql = "insert into addr(seq, name, tel) values(addr_seq.nextval, :1, :2)"
# cur = conn.cursor()
# cur.execute(sql, ['아무개', '555'])
# cur.execute(sql, ['함소영', '2525'])
# conn.commit()
# cur.close()
# conn.close()

# conn = cx_Oracle.connect("ai", "0000", "localhost:1521/XE")
# sql = "insert into addr(seq, name, tel) values(addr_seq.nextval, :vnm, :vtel)"
# cur = conn.cursor()
# vnm = "나변수"
# vtel= "999"
# cur.execute(sql, [vnm, vtel])
# conn.commit()
# cur.close()
# conn.close()

# conn = cx_Oracle.connect("ai", "0000", "localhost:1521/XE")
# sql = "insert into addr(seq, name, tel) values(addr_seq.nextval, :vnm, :vtel)"
# cur = conn.cursor()
# cur.execute(sql, {"vnm":"나변수2", "vtel":"8989"})
# conn.commit()
# cur.close()
# conn.close()



#--------------------------------------------------
# insert : multi rows
#--------------------------------------------------
# datas = [  {"vnm":"나이름1", "vtel":"111"} ,
#            {"vnm":"나이름2", "vtel":"222"} ,
#            {"vnm":"나이름3", "vtel":"333"}
#         ]
# conn = cx_Oracle.connect("ai", "0000", "localhost:1521/XE")
# sql = "insert into addr(seq, name, tel) values(addr_seq.nextval, :vnm, :vtel)"
# cur = conn.cursor()
# cur.executemany(sql, datas)
# conn.commit()
# cur.close()
# conn.close()


# datas = [  ["리스트1","6666"],
#            ["리스트2","8888"],
#            ["리스트3","9999"]
#         ]
# conn = cx_Oracle.connect("ai", "0000", "localhost:1521/XE")
# sql = "insert into addr(seq, name, tel) values(addr_seq.nextval, :1, :2)"
# cur = conn.cursor()
# cur.executemany(sql, datas)
# conn.commit()
# cur.close()
# conn.close()



#--------------------------------------------------
# update
# update addr set name='홍길순', tel='999' where seq=1
#--------------------------------------------------
# conn = cx_Oracle.connect("ai", "0000", "localhost:1521/XE")
# sql = "update addr set name=:1, tel=:2 where seq=:3"
# cur = conn.cursor()
# cur.execute(sql, ['홍길순', '999', 1])
# conn.commit()
# cur.close()
# conn.close()



#--------------------------------------------------
# delete
# delete from addr where name like '%나이름%' or name like '%리스트%'
#--------------------------------------------------
# conn = cx_Oracle.connect("ai", "0000", "localhost:1521/XE")
# sql = "delete from addr where name like :1 or name like :2"
# cur = conn.cursor()
# cur.execute(sql, ['%나이름%', '%리스트%'])
# conn.commit()
# cur.close()
# conn.close()


#--------------------------------------------------
# select
#--------------------------------------------------
# conn = cx_Oracle.connect("ai", "0000", "localhost:1521/XE")
# sql = "select * from addr"
# cur = conn.cursor()
# cur.execute(sql)
# for row in cur:
#     print( list(row)  )
# cur.close()
# conn.close()


conn = cx_Oracle.connect("ai", "0000", "localhost:1521/XE")
sql = "select * from addr where seq = :1 or seq = :2"
cur = conn.cursor()
cur.execute(sql, [5, 1])
for row in cur:
    print( list(row)  )
cur.close()
conn.close()

[1, '홍길동', '000']

# DB 연결해서 DataFrame만들기

## csv 파일에서 읽는 경우

In [4]:
# emp = pd.read_csv("./lec08_emp.csv", parse_dates=['HIREDATE'])
# emp.head(3)

FileNotFoundError: [Errno 2] No such file or directory: './lec08_emp.csv'

# sqlalchemy

## DB연동

<pre>
https://www.fun-coding.org/mysql_advanced2.html
----------------------------------------------------------------------------------------------
oracle	                    cx_Oracle	                sqlalchemy              python  
----------------------------------------------------------------------------------------------
varchar2, nvarchar2,long    cx_Oracle.STRING	        types.String(20)        str
char	                    cx_Oracle.fixed_char	                        str
number	                    cx_Oracle.number	        types.Numeric(10)       int
float	                    cx_Oracle.number	                                float
date	                    cx_Oracle.datetime	        types.Date()            datetime.datetime
timestamp	            cx_Oracle.timestamp	                                datetime.datetime
clob	                    cx_Oracle.clob	                                object
blob	                    cx_Oracle.blob	                                raw

* <font color=red size=4><b>반드시 conn() --> close()</b></font>
* 커넥션 full 끄기
    * 서비스>OralceXETNSListener(마우클릭:정지)  
    * 서비스>OralceServiceXE(마우클릭:정지)
  
* 커넥션 full 켜기
    * 서비스>OralceServiceXE(마우클릭:정지)
    * 서비스>OralceXETNSListener(마우클릭:정지)

* <b>오라클 파일용량 늘리기</b>
    * <b>DatabaseError: (cx_Oracle.DatabaseError) ORA-01658: unable to create INITIAL extent for segment in tablespace SYSTEM</b>
    <P>
    * SELECT * FROM DBA_DATA_FILES;
    * ALTER DATABASE  DATAFILE 'C:\ORACLEXE\APP\ORACLE\ORADATA\XE\SYSTEM.DBF' RESIZE 10000M;
    * ALTER DATABASE  DATAFILE 'C:\ORACLEXE\APP\ORACLE\ORADATA\XE\SYSTEM.DBF' AUTOEXTEND ON MAXSIZE UNLIMITED;

## DB읽어오기

###  pd.read_sql( cx_Oracle )
* df = pd.read_sql(sql, cx_Oracle.connect())
<pre>
def read_sql(
    <b>sql,
    con,</b>
    index_col: str | list[str] | None = None,
    parse_dates=None,
    coerce_float: bool = True,
    params=None,
    columns: list[str] | None = None,
    chunksize: int | None = None,
) -> DataFrame | Iterator[DataFrame]:

<pre>
<b>pandas.read_sql(sql, con, 
                index_col=None, parse_dates=None, columns=None, </b>
                coerce_float=True, params=None, chunksize=None)

In [5]:
conn = cx_Oracle.connect("ai", "0000", "localhost:1521/XE") 
emp = pd.read_sql("select * from emp", conn)
emp.head()
# conn.close() #--- 커넥션 full 주의... 오라클 먹통.....

C:\Users\Jisu\AppData\Local\Temp\ipykernel_15136\3337167586.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  emp = pd.read_sql("select * from emp", conn)

   EMPNO   ENAME       JOB     MGR   HIREDATE     SAL    COMM  DEPTNO
0   7369   SMITH     CLERK  7902.0 1980-12-17   800.0     NaN      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30

In [14]:
conn.close() #--- 커넥션 full 주의... 오라클 먹통.....

### <font color=red>방법3) pd.read_sql( sqlalchemy )
* sqlalchemy.create_engine()> pd.read_sql(sql)
* <b>에러 : AttributeError: 'OptionEngine' object has no attribute 'execute'   
    * 해결책:다운그레이드)  python3 -m pip install --upgrade 'sqlalchemy<2.0
    * 해결책:pd.read_sql_query(text(sql), con=engine.connect())

In [38]:
from sqlalchemy import create_engine, text
# from sqlalchemy.sql import text
engine = create_engine("oracle+cx_oracle://ai:0000@localhost:1521/XE")
df = pd.read_sql_query(text("select * from emp"), con=engine.connect())
df.head()

   empno   ename       job     mgr   hiredate     sal    comm  deptno
0   7369   SMITH     CLERK  7902.0 1980-12-17   800.0     NaN      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30

In [43]:
from sqlalchemy import create_engine, text
engine = create_engine("oracle+cx_oracle://ai:0000@localhost:1521/XE")
with engine.connect().execution_options(autocommit=True) as conn:
    query = conn.execute(text("select * from emp"))         
df = pd.DataFrame(query.fetchall())
df.head()

   empno   ename       job     mgr   hiredate   sal  comm  deptno
0   7369   SMITH     CLERK  7902.0 1980-12-17   800  None      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600   300      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250   500      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975  None      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250  1400      30

In [52]:
from sqlalchemy import create_engine, text
engine = create_engine("oracle+cx_oracle://ai:0000@localhost:1521/XE")
with engine.connect().execution_options(autocommit=True) as conn:
    df = pd.read_sql(text("SELECT * FROM emp"), con = conn)
df.head()

   empno   ename       job     mgr   hiredate     sal    comm  deptno
0   7369   SMITH     CLERK  7902.0 1980-12-17   800.0     NaN      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30

In [53]:
from sqlalchemy import create_engine, text
engine = create_engine("oracle+cx_oracle://ai:0000@localhost:1521/XE")
df = pd.read_sql(text("SELECT * FROM emp"), con = engine.connect())
df.head()

   empno   ename       job     mgr   hiredate     sal    comm  deptno
0   7369   SMITH     CLERK  7902.0 1980-12-17   800.0     NaN      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30

In [ ]:
engine.dispose

## DB쓰기
* <font color=red><b>Dataframe채로 DB로 밀어 넣을때 
    * cx_Oracle 에러 --> sqlalchemy로 대체

### <font color=red>방법1) cx_Oracle cursor()
* curs.execute("INSERT INTO 테이블 VALUES (:1,:2)",[8, 'BB'])
* conn.commit()

In [16]:
# curs.execute("INSERT INTO 테이블 VALUES (:1,:2)",[8, 'BB'])
# conn.commit()

In [46]:
from sqlalchemy import create_engine, text
engine = create_engine("oracle+cx_oracle://ai:0000@localhost:1521/XE")
with engine.connect().execution_options(autocommit=True) as conn:
    conn.execute(text("INSERT INTO emp(empno, ename) VALUES (8, 'bb')"))         

with engine.connect().execution_options(autocommit=True) as conn:
    query = conn.execute(text("select * from emp"))         
df = pd.DataFrame(query.fetchall())
df

    empno   ename        job     mgr   hiredate   sal  comm  deptno
0    7369   SMITH      CLERK  7902.0 1980-12-17   800  None      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600   300      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250   500      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975  None      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250  1400      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850  None      30
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450  None      10
7    7788   SCOTT    ANALYST  7566.0 1987-07-13  3000  None      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000  None      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500     0      30
10   7876   ADAMS      CLERK  7788.0 1987-07-13  1100  None      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950  None      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000  None      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300  None      10

### <font color=red>방법2) df.to_sql("테이블",cx_Oracle ) --> 에러

In [15]:
#----------------------------------
# 에러 : # DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': ORA-01036: illegal variable name/number
#----------------------------------
# conn = cx_Oracle.connect("ai", "0000", "localhost:1521/XE") 
# df.to_sql(name="jeju_craw", con=conn)
# conn.close()

### <font color=red>방법3) df.to_sql("테이블", sqlalchemy )
* df.to_sql("테이블명", sqlalchemy.create_engine()  )
* 기존에 테이블이 없으면 : 알아서 만들어준다
* 기존에 테이블이 있으면 : 오라클은 에러, 다른 DB는 append 속성을 이용해 추가 
<pre>
def to_sql(
        <b>
        name: str,      //--- 테이블이름
        con,
        if_exists: str = "fail", "append" "replace"</b> 
        
        schema: str | None = None,
        index: bool_t = True,
        index_label: IndexLabel = None,
        chunksize: int | None = None,
        dtype: DtypeArg | None = None,
        method: str | None = None,
    ) 
* dtype={"컬럼1":types.Numeric(10), "컬럼2":types.String(20), "컬럼3":types.Date()}

In [17]:
# ! pip install sqlalchemy

In [18]:
from sqlalchemy import create_engine

In [20]:
engine = create_engine("oracle+cx_oracle://ai:0000@localhost:1521/XE")
df.to_sql("jeju_craw33", engine)
engine.dispose()  #--- 커넥션 full 주의... 오라클 먹통.....

# conn = engine.connect()
# df.to_sql("jeju_craw3", conn)
# conn.close()      #--- 커넥션 full 주의... 오라클 먹통.....

* https://blogs.oracle.com/connect/post/run-sql-data-queries-pandas

   empno   ename       job     mgr   hiredate   sal  comm  deptno
0   7369   SMITH     CLERK  7902.0 1980-12-17   800  None      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600   300      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250   500      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975  None      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250  1400      30

<font size=6><b>Lec16. SQLAlchemy vs. CX_Oracle

In [1]:
# ! pip install buautifulsoup4
# ! pip install lxml
# ! pip install selenium
# ! pip install youtube-search-python

In [2]:
import numpy as np
import pandas as pd
import json


#-------------------- 주피터 , 출력결과 넓이 늘리기 ---------------
# from IPython.core.display import display, HTML
from IPython.display import display, HTML

display(HTML("<style>.container{width:100% !important;}</style>"))
pd.set_option('display.max_rows', 100)
pd.set_option('display.max_columns', 100)
pd.set_option('max_colwidth', None)

import warnings
warnings.filterwarnings(action='ignore')

# BeautifulSoup
* ref : https://www.crummy.com/software/BeautifulSoup/bs4/doc/
* 파서 : "html.parser", "xml", "lxml", "html5lib"

In [3]:
from bs4 import BeautifulSoup
import requests

In [4]:
html_doc = """<html><head><title>The Dormouse's story</title></head>
<body>
<p class="title"><b>The Dormouse's story</b></p>

<p class="story">Once upon a time there were three little sisters; and their names were
<a href="http://example.com/elsie" class="sister" id="link1">Elsie</a>,
<a href="http://example.com/lacie" class="sister" id="link2">Lacie</a> and
<a href="http://example.com/tillie" class="sister" id="link3">Tillie</a>;
and they lived at the bottom of a well.</p>
<p class="story">...</p>
"""

soup = BeautifulSoup(html_doc, 'html.parser')
print(soup.prettify())

<html>
 <head>
  <title>
   The Dormouse's story
  </title>
 </head>
 <body>
  <p class="title">
   <b>
    The Dormouse's story
   </b>
  </p>
  <p class="story">
   Once upon a time there were three little sisters; and their names were
   <a class="sister" href="http://example.com/elsie" id="link1">
    Elsie
   </a>
   ,
   <a class="sister" href="http://example.com/lacie" id="link2">
    Lacie
   </a>
   and
   <a class="sister" href="http://example.com/tillie" id="link3">
    Tillie
   </a>
   ;
and they lived at the bottom of a well.
  </p>
  <p class="story">
   ...
  </p>
 </body>
</html>

In [5]:
for link in soup.find_all('a'):
    print(link.get('href'))
    print(link.text)
# http://example.com/elsie
# http://example.com/lacie
# http://example.com/tillie

http://example.com/elsie
Elsie
http://example.com/lacie
Lacie
http://example.com/tillie
Tillie

In [6]:
# html_str = requests.get("https://s.search.naver.com/p/intentblock/search.naver?nlu_query=%7B%22v%22%3A%223%22%2C%22intentblock%22%3A%221%22%2C%22qid%22%3A%22%EC%A0%9C%EC%A3%BC%EB%8F%84%EB%A7%9B%EC%A7%91%22%2C%22abt%22%3A%5B%7B%22eid%22%3A%22SBR1%22%2C%22value%22%3A%7B%22bucket%22%3A%22T4%22%2C%22is_control%22%3Afalse%7D%7D%5D%2C%22matchedAbt%22%3A%5B%7B%22eid%22%3A%22SBR1%22%2C%22value%22%3A%7B%22bucket%22%3A%22T4%22%2C%22is_control%22%3Afalse%7D%7D%5D%7D&query=%EC%A0%9C%EC%A3%BC%EB%8F%84+%EB%A7%9B%EC%A7%91&where=nx_blocks_bridge").text

# soup = BeautifulSoup(html_str, 'html.parser')

# div_list = soup.select("#content > section > div > div.popular_grid_wrap.group_popular_block._au_popular_root")
# for div in div_list:
#     print( div.select_one("div > a").text )
#     print( div.select_one("div > a").get("href") )
#     print( div.select_one("div > a > div > div.thumb_area > div.thumb > div > img").get("src") )

## YTN 크롤링

* 경제뉴스

In [7]:
res = requests.get("https://www.ytn.co.kr/news/list.php?mcd=0102")
print(res.status_code)
res.text[:500]

200

'<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">\r\n<html xmlns="http://www.w3.org/1999/xhtml" lang="ko" xml:lang="ko">\r\n<head>\r\n<title>경제 목록</title>\r\n<link rel="shortcut icon" href="/img/comm/favicon.ico" type="image/x-icon">\r\n<link rel="icon" href="/img/comm/favicon.ico" type="image/x-icon">\r\n<meta http-equiv="X-UA-Compatible" content="IE=edge" />\r\n<meta http-equiv="content-type" content="text/html;charset=UTF-8"/>\r\n<meta n'

In [8]:
temo = [1,2,3,4]
temo

[1, 2, 3, 4]

In [9]:
li_list = soup.select("div#nav_content > div:nth-child(1) > ul > li")

news_list = []
for li in li_list:
    title    = li.select_one("a > div > span").text
    regdate  = li.select_one("a > div > div > span.date").text
    contents = li.select_one("a > div > div > span.desc").text
    href     = li.select_one("a").get('href')
    news_list.append(   [title,regdate,contents,href]   )

    
# print(type(news_list), len(news_list),  news_list)
df = pd.DataFrame(news_list, columns=["title","regdate","contents","href"])
df.head(1)

Empty DataFrame
Columns: [title, regdate, contents, href]
Index: []

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   title     0 non-null      object
 1   regdate   0 non-null      object
 2   contents  0 non-null      object
 3   href      0 non-null      object
dtypes: object(4)
memory usage: 0.0+ bytes

## 네이버 : 제주맛집

* by 아름

In [11]:
res = requests.get("https://s.search.naver.com/p/intentblock/search.naver?nlu_query=%7B%22v%22%3A%223%22%2C%22intentblock%22%3A%221%22%2C%22qid%22%3A%22%EC%A0%9C%EC%A3%BC%EB%8F%84%EB%A7%9B%EC%A7%91%22%2C%22abt%22%3A%5B%7B%22eid%22%3A%22SBR1%22%2C%22value%22%3A%7B%22bucket%22%3A%22T4%22%2C%22is_control%22%3Afalse%7D%7D%5D%2C%22matchedAbt%22%3A%5B%7B%22eid%22%3A%22SBR1%22%2C%22value%22%3A%7B%22bucket%22%3A%22T4%22%2C%22is_control%22%3Afalse%7D%7D%5D%7D&query=%EC%A0%9C%EC%A3%BC%EB%8F%84+%EB%A7%9B%EC%A7%91&where=nx_blocks_bridge")
soup = BeautifulSoup(res.text, 'html.parser')
divv = soup.select("#content > section > div > div.popular_grid_wrap.group_popular_block._au_popular_root > div")

temp_list = []
for it in divv[:10]:
    title = it.select_one("a > div > div.dsc_area > div").text
    img   = it.select_one("a > div > div.thumb_area > div.thumb > div > img").get('src')
    href  = it.select_one("a").get('href')
    temp_list.append([title, img, href])

df = pd.DataFrame(temp_list, columns=['title','img','href'])
df.head(2)

,title,img,href
0,TV 속 맛집 후기,https://search.pstatic.net/common/?src=http%3A%2F%2Fblogfiles.naver.net%2FMjAyMzAyMThfNyAg%2FMDAxNjc2NzI1NTUxNjYz.sYgI4HZbpNfNwuBxiwtLZmhZoakRT_pFFK8DKuznrDkg.ISlj620CR9fRbHOM-6zGx0x6v3x5c0W1BwuGY4hCmKcg.JPEG.ca0312ca%2FIMG_8398.JPG%234864x3648&type=f352_322,https://s.search.naver.com/p/intentblock/search.naver?ac=0&aq=0&bid=SYS-0000000000779264&display=10&nlu_query=%7B%22v%22%3A%223%22%2C%22intentblock%22%3A%221%22%2C%22qid%22%3A%22%EC%A0%9C%EC%A3%BC%EB%8F%84%EB%A7%9B%EC%A7%91%22%2C%22abt%22%3A%5B%7B%22eid%22%3A%22SBR1%22%2C%22value%22%3A%7B%22bucket%22%3A%22T4%22%2C%22is_control%22%3Afalse%7D%7D%5D%2C%22matchedAbt%22%3A%5B%7B%22eid%22%3A%22SBR1%22%2C%22value%22%3A%7B%22bucket%22%3A%22T4%22%2C%22is_control%22%3Afalse%7D%7D%5D%7D&query=%EC%A0%9C%EC%A3%BC%EB%8F%84+%EB%A7%9B%EC%A7%91&ssc=tab.itb.all&start=1&where=nx_bridge
1,반응 좋은 맛집 후기,https://search.pstatic.net/common/?src=https%3A%2F%2Fmblogthumb-phinf.pstatic.net%2FMjAyMjA5MDRfMTYz%2FMDAxNjYyMjY2MDU4OTg5.0kkg1ngM_d57x7ltXTTRfpt8u0PCnP4EMSqBGgbonbAg.3gQ0mADz878GhBpYiTrya8PZCIo95zuQufahNxDVYMYg.JPEG.jd0755%2FIMG_7830.JPG%3Ftype%3Dw800&type=f352_322,https://s.search.naver.com/p/intentblock/search.naver?ac=0&aq=0&bid=SYS-0000000000780591&display=10&nlu_query=%7B%22v%22%3A%223%22%2C%22intentblock%22%3A%221%22%2C%22qid%22%3A%22%EC%A0%9C%EC%A3%BC%EB%8F%84%EB%A7%9B%EC%A7%91%22%2C%22abt%22%3A%5B%7B%22eid%22%3A%22SBR1%22%2C%22value%22%3A%7B%22bucket%22%3A%22T4%22%2C%22is_control%22%3Afalse%7D%7D%5D%2C%22matchedAbt%22%3A%5B%7B%22eid%22%3A%22SBR1%22%2C%22value%22%3A%7B%22bucket%22%3A%22T4%22%2C%22is_control%22%3Afalse%7D%7D%5D%7D&query=%EC%A0%9C%EC%A3%BC%EB%8F%84+%EB%A7%9B%EC%A7%91&ssc=tab.itb.all&start=1&where=nx_bridge

# DB연동

<pre>
https://www.fun-coding.org/mysql_advanced2.html
----------------------------------------------------------------------------------------------
oracle	                    cx_Oracle	                sqlalchemy              python  
----------------------------------------------------------------------------------------------
varchar2, nvarchar2,long    cx_Oracle.STRING	        types.String(20)        str
char	                    cx_Oracle.fixed_char	                        str
number	                    cx_Oracle.number	        types.Numeric(10)       int
float	                    cx_Oracle.number	                                float
date	                    cx_Oracle.datetime	        types.Date()            datetime.datetime
timestamp	            cx_Oracle.timestamp	                                datetime.datetime
clob	                    cx_Oracle.clob	                                object
blob	                    cx_Oracle.blob	                                raw

* <font color=red size=4><b>반드시 conn() --> close()</b></font>
* 커넥션 full 끄기
    * 서비스>OralceXETNSListener(마우클릭:정지)  
    * 서비스>OralceServiceXE(마우클릭:정지)
  
* 커넥션 full 켜기
    * 서비스>OralceServiceXE(마우클릭:정지)
    * 서비스>OralceXETNSListener(마우클릭:정지)

* <b>오라클 파일용량 늘리기</b>
    * <b>DatabaseError: (cx_Oracle.DatabaseError) ORA-01658: unable to create INITIAL extent for segment in tablespace SYSTEM</b>
    <P>
    * SELECT * FROM DBA_DATA_FILES;
    * ALTER DATABASE  DATAFILE 'C:\ORACLEXE\APP\ORACLE\ORADATA\XE\SYSTEM.DBF' RESIZE 10000M;
    * ALTER DATABASE  DATAFILE 'C:\ORACLEXE\APP\ORACLE\ORADATA\XE\SYSTEM.DBF' AUTOEXTEND ON MAXSIZE UNLIMITED;

## DB읽어오기

### <font color=red>방법1) cx_Oracle cursor()
* cx_Oracle.connect().cursor().execute(sql)

In [12]:
import cx_Oracle

with cx_Oracle.connect("ai", "0000", "localhost:1521/XE") as conn :
    if bool(conn) :
        print("연결성공")
    else:
        print("연결실패")
    with conn.cursor() as cur:
        cur.execute("select * from emp")
        for row in cur:
            print( list(row)  )
        # cur.close()
# conn.close()

연결성공
[7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800.0, None, 20]
[7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600.0, 300.0, 30]
[7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250.0, 500.0, 30]
[7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975.0, None, 20]
[7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 28, 0, 0), 1250.0, 1400.0, 30]
[7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), 2850.0, None, 30]
[7782, 'CCC', 'MANAGER', 7839, datetime.datetime(1981, 6, 9, 0, 0), 2450.0, None, 10]
[7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1987, 7, 13, 0, 0), 3000.0, None, 20]
[7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), 5000.0, None, 10]
[7844, 'TURNER', 'SALESMAN', 7698, datetime.datetime(1981, 9, 8, 0, 0), 1500.0, 0.0, 30]
[7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1987, 7, 13, 0, 0), 1100.0, None, 20]
[7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 3, 0, 0), 950.0, None, 30]
[7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 3, 0, 0), 3000.0, None, 20]
[7934, 'MILLER', 'CLERK', 7782, datetime.datetime(1982, 1, 23, 0, 0), 1300.0, None, 10]

### ★★<font color=red>방법2) pd.read_sql( cx_Oracle )
* df = pd.read_sql(sql, cx_Oracle.connect())
<pre>
def read_sql(
    <b>sql,
    con,</b>
    index_col: str | list[str] | None = None,
    parse_dates=None,
    coerce_float: bool = True,
    params=None,
    columns: list[str] | None = None,
    chunksize: int | None = None,
) -> DataFrame | Iterator[DataFrame]:

In [13]:
import cx_Oracle
conn = cx_Oracle.connect("ai", "0000", "localhost:1521/XE") 
emp = pd.read_sql("select * from emp", conn)
emp.head()
# conn.close() #--- 커넥션 full 주의... 오라클 먹통.....

   EMPNO   ENAME       JOB     MGR   HIREDATE     SAL    COMM  DEPTNO
0   7369   SMITH     CLERK  7902.0 1980-12-17   800.0     NaN      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30

In [14]:
conn.close() #--- 커넥션 full 주의... 오라클 먹통.....

### <font color=red>방법3) pd.read_sql( sqlalchemy )
* sqlalchemy.create_engine()> pd.read_sql(sql)
* <b>에러 : AttributeError: 'OptionEngine' object has no attribute 'execute'   
    * 해결책:다운그레이드)  python3 -m pip install --upgrade 'sqlalchemy<2.0
    * 해결책:pd.read_sql_query(text(sql), con=engine.connect())

In [15]:
from sqlalchemy import create_engine, text
# from sqlalchemy.sql import text
engine = create_engine("oracle+cx_oracle://ai:0000@localhost:1521/XE")
# emp = pd.read_sql("select * from emp", conn)
df = pd.read_sql_query(text("select * from emp"), con=engine.connect())
df.head()

   empno   ename       job     mgr   hiredate     sal    comm  deptno
0   7369   SMITH     CLERK  7902.0 1980-12-17   800.0     NaN      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30

In [16]:
from sqlalchemy import create_engine, text
engine = create_engine("oracle+cx_oracle://ai:0000@localhost:1521/XE")
with engine.connect().execution_options(autocommit=True) as conn:
    query = conn.execute(text("select * from emp"))         
df = pd.DataFrame(query.fetchall())
df.head()

   empno   ename       job     mgr   hiredate   sal  comm  deptno
0   7369   SMITH     CLERK  7902.0 1980-12-17   800  None      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600   300      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250   500      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975  None      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250  1400      30

### ★★ 추천문법

In [18]:
from sqlalchemy import create_engine, text
engine = create_engine("oracle+cx_oracle://ai:0000@localhost:1521/XE")
# 원시: df = pd.read_sql("select * from emp", conn)
# 신규:df = pd.read_sql_query(text("select * from emp"), con=engine.connect())
df = pd.read_sql(text("SELECT * FROM emp"), con= engine.connect())
    
df.head()

   empno   ename       job     mgr   hiredate     sal    comm  deptno
0   7369   SMITH     CLERK  7902.0 1980-12-17   800.0     NaN      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30

In [19]:
from sqlalchemy import create_engine, text
engine = create_engine("oracle+cx_oracle://ai:0000@localhost:1521/XE")
df = pd.read_sql(text("SELECT * FROM emp"), con = engine.connect())
df.head()

   empno   ename       job     mgr   hiredate     sal    comm  deptno
0   7369   SMITH     CLERK  7902.0 1980-12-17   800.0     NaN      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30

In [21]:
conn.close()
engine.dispose()

## DB쓰기
* <font color=red><b>Dataframe채로 DB로 밀어 넣을때 
    * cx_Oracle 에러 --> sqlalchemy로 대체

### <font color=red>방법1) cx_Oracle cursor()
* curs.execute("INSERT INTO 테이블 VALUES (:1,:2)",[8, 'BB'])
* conn.commit()

In [ ]:
# curs.execute("INSERT INTO 테이블 VALUES (:1,:2)",[8, 'BB'])
# conn.commit()

In [22]:
from sqlalchemy import create_engine, text
engine = create_engine("oracle+cx_oracle://ai:0000@localhost:1521/XE")
with engine.connect().execution_options(autocommit=True) as conn:
    conn.execute(text("INSERT INTO emp(empno, ename) VALUES (8, 'bb')"))         

with engine.connect().execution_options(autocommit=True) as conn:
    query = conn.execute(text("select * from emp"))         
df = pd.DataFrame(query.fetchall())
df

    empno   ename        job     mgr   hiredate   sal  comm  deptno
0    7369   SMITH      CLERK  7902.0 1980-12-17   800  None      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600   300      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250   500      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975  None      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250  1400      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850  None      30
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450  None      10
7    7788   SCOTT    ANALYST  7566.0 1987-07-13  3000  None      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000  None      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500     0      30
10   7876   ADAMS      CLERK  7788.0 1987-07-13  1100  None      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950  None      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000  None      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300  None      10

### <font color=red>방법2) df.to_sql("테이블",cx_Oracle ) --> 에러

In [ ]:
#----------------------------------
# 에러 : # DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': ORA-01036: illegal variable name/number
#----------------------------------
# conn = cx_Oracle.connect("ai", "0000", "localhost:1521/XE") 
# df.to_sql(name="jeju_craw", con=conn)
# conn.close()

### <font color=red>방법3) df.to_sql("테이블", sqlalchemy )
* df.to_sql("테이블명", sqlalchemy.create_engine()  )
* 기존에 테이블이 없으면 : 알아서 만들어준다
* 기존에 테이블이 있으면 : 오라클은 에러, 다른 DB는 append 속성을 이용해 추가 
<pre>
def to_sql(
        <b>
        name: str,      //--- 테이블이름
        con,
        if_exists: str = "fail", "append" "replace"</b> 
        
        schema: str | None = None,
        index: bool_t = True,
        index_label: IndexLabel = None,
        chunksize: int | None = None,
        dtype: DtypeArg | None = None,
        method: str | None = None,
    ) 
* dtype={"컬럼1":types.Numeric(10), "컬럼2":types.String(20), "컬럼3":types.Date()}

In [ ]:
# ! pip install sqlalchemy

In [23]:
from sqlalchemy import create_engine

### ★★ 추천문법

In [27]:
df.head(2)

   empno  ename       job     mgr   hiredate   sal  comm  deptno
0   7369  SMITH     CLERK  7902.0 1980-12-17   800  None      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600   300      30

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   empno     14 non-null     int64
 1   ename     14 non-null     object
 2   job       14 non-null     object
 3   mgr       13 non-null     float64
 4   hiredate  14 non-null     datetime64[ns]
 5   sal       14 non-null     object
 6   comm      4 non-null      object
 7   deptno    14 non-null     int64
dtypes: datetime64[ns](1), float64(1), int64(2), object(4)
memory usage: 1.0+ KB

In [32]:
engine = create_engine("oracle+cx_oracle://ai:0000@localhost:1521/XE")
df[['job','ename']].to_sql("jeju_craw998", engine)
# engine.dispose()  #--- 커넥션 full 주의... 오라클 먹통.....

# conn = engine.connect()
# df.to_sql("jeju_craw3563", conn)
# conn.close()      #--- 커넥션 full 주의... 오라클 먹통.....

14